
# name -> расшифровка
types_mapping = {
    "norm": ("(N)Нормальный ритм", "Ритм сердца"),
    "tah": ("Синусовая тахикардия", "Ритм сердца"),
    "brad": ("Синусовая брадикардия", "Ритм сердца"),
    "extrasys": ("Экстрасистолия", "Ритм сердца"),
    "aritm": ("Синусовая аритмия", "Ритм сердца"),
    "trepred": ("Трепетание предсердий", "Ритм сердца"),
    "afib": ("Фибрилляция предсердий", "Ритм сердца"),
    "vfib": ("Трепетание и фибрилляция желудочков", "Ритм сердца"),

    "atrio1": ("Атриовентрикулярная блокада I", "Нарушения функции проводимости"),
    "artio2": ("Атриовентрикулярная блокада II", "Нарушения функции проводимости"),
    "atrio3": ("Атриовентрикулярная блокада III", "Нарушения функции проводимости"),
    "lgis": ("(БЛНПГ)Блокада левой ножки пучка Гиса", "Нарушения функции проводимости"),
    "nlgis": ("(НБЛНПГ)Неполная блокада левой ножки пучка Гиса", "Нарушения функции проводимости"),
    "pgis": ("(ПБПНПГ)Полная блокада правой ножки пучка Гиса", "Нарушения функции проводимости"),
    "npgis": ("(НБПНПГ)Неполная блокада правой ножки пучка Гиса", "Нарушения функции проводимости"),

    "glj": ("Гипертрофия левого желудочка", "Другие Показатели"),
    "gpj": ("Гипертрофия правого желудочка", "Другие Показатели"),
    "glp": ("Гипертрофия левого предсердия", "Другие Показатели"),
    "gpp": ("Гипертрофия правого предсердия", "Другие Показатели"),
    "ishmio": ("Ишемия миокарда", "Другие Показатели"),
    "inmio": ("Инфаркт миокарда", "Другие Показатели")
}
