types_mapping = {
    "1": ("(N)Нормальный ритм"),
    "2": ("Синусовая тахикардия"),
    "3": ("Синусовая брадикардия"),
    "4": ("Экстрасистолия"),
    "5": ("Синусовая аритмия"),
    "6": ("Трепетание предсердий"),
    "7": ("Фибрилляция предсердий"),
    "8": ("Трепетание и фибрилляция желудочков"),

    "11": ("Атриовентрикулярная блокада I"),
    "12": ("Атриовентрикулярная блокада II"),
    "13": ("Атриовентрикулярная блокада III"),
    "14": ("(БЛНПГ)Блокада левой ножки пучка Гиса"),
    "15": ("(НБЛНПГ)Неполная блокада левой ножки пучка Гиса"),
    "16": ("(ПБПНПГ)Полная блокада правой ножки пучка Гиса"),
    "17": ("(НБПНПГ)Неполная блокада правой ножки пучка Гиса"),

    "21": ("Гипертрофия левого желудочка"),
    "22": ("Гипертрофия правого желудочка"),
    "23": ("Гипертрофия левого предсердия"),
    "24": ("Гипертрофия правого предсердия"),
    "25": ("Ишемия миокарда"),
    "26": ("Инфаркт миокарда")
}

default_data = [
    {'group_label': "Ритм сердца",
     'group_data': [{"view": "checkbox", "label": "(N)Нормальный ритм", "value": 0, "name": "1"},
                    {"view": "checkbox", "label": "Синусовая тахикардия", "value": 0, "name": "2"},
                    {"view": "checkbox", "label": "Синусовая брадикардия", "value": 0, "name": "3"},
                    {"view": "checkbox", "label": "Экстрасистолия", "value": 0, "name": "4"},
                    {"view": "checkbox", "label": "Синусовая аритмия", "value": 0, "name": "5"},
                    {"view": "checkbox", "label": "Трепетание предсердий", "value": 0, "name": "6"},
                    {"view": "checkbox", "label": "Фибрилляция предсердий", "value": 0, "name": "7"},
                    {"view": "checkbox", "label": "Трепетание и фибрилляция желудочков", "value": 0, "name": "8"}

                    ]},
    {'group_label': "Нарушения функции проводимости",
     'group_data': [{"view": "checkbox", "label": "Атриовентрикулярная блокада I", "value": 0, "name": "11"},
                    {"view": "checkbox", "label": "Атриовентрикулярная блокада II", "value": 0, "name": "12"},
                    {"view": "checkbox", "label": "Атриовентрикулярная блокада III", "value": 0, "name": "13"},
                    {"view": "checkbox", "label": "(БЛНПГ)Блокада левой ножки пучка Гиса", "value": 0, "name": "14"},
                    {"view": "checkbox", "label": "(НБЛНПГ)Неполная блокада левой ножки пучка Гиса", "value": 0,
                     "name": "15"},
                    {"view": "checkbox", "label": "(ПБПНПГ)Полная блокада правой ножки пучка Гиса", "value": 0,
                     "name": "16"},
                    {"view": "checkbox", "label": "(НБПНПГ)Неполная блокада правой ножки пучка Гиса", "value": 0,
                     "name": "17"}
                    ]},
    {'group_label': "Другие Показатели",
     'group_data': [{"view": "checkbox", "label": "Гипертрофия левого желудочка", "value": 0, "name": "21"},
                    {"view": "checkbox", "label": "Гипертрофия правого желудочка", "value": 0, "name": "22"},
                    {"view": "checkbox", "label": "Гипертрофия левого предсердия", "value": 0, "name": "23"},
                    {"view": "checkbox", "label": "Гипертрофия правого предсердия", "value": 0, "name": "24"},
                    {"view": "checkbox", "label": "Ишемия миокарда", "value": 0, "name": "25"},
                    {"view": "checkbox", "label": "Инфаркт миокарда", "value": 0, "name": "26"},
                    ]}

]
